{"data":{"allWordpressPost":{"nodes":[{"slug":"guildmaster-chapter46","title":"Guild Master &#8211; Chapter 46","excerpt":"<p>The three guilds&#8217; meeting and a Guild Master&#8217;s pride Mizuha and her brother came to live in our guild&#8217;s dormitory. I suggested Zect to mainly accept the dungeon-exploring requests, and he looked fine with that, so I put him into the ‘scouting unit’, while his sister became a trainee in the ‘intelligence unit’. The young [&hellip;]</p>\n"},{"slug":"newgame-chapter41","title":"New Game &#8211; Chapter 41","excerpt":"<p>What was of the man who opened the birdcage &#8211; Part 3 Takumi returned to Suzuran after the meeting. “Hi guys, sorry it took me so long&#8230; what&#8217;s going on here?” A loud noise invested him when he opened the door. He saw a little crowd cramped in the dining room. Suzuran&#8217;s three most famous [&hellip;]</p>\n"},{"slug":"guildmaster-chapter45","title":"Guild Master &#8211; Chapter 45","excerpt":"<p>The tipsy fox and the demon form&#8217;s after-effects As Mizuha emerged from the bathtub, I secured my towel around my waist. How did I end up in this situation? She was stark naked. If I had to compare her with Yuma—and I won&#8217;t specify what part I&#8217;m talking about—I&#8217;d say it was evident that she [&hellip;]</p>\n"},{"slug":"newgame-chapter40","title":"New Game &#8211; Chapter 40","excerpt":"<p>What was of the man who opened the birdcage &#8211; Part 2 The dark basement room was painted with pale shades of melancholy. The dim sources of light glowing around were scattered magic tools. Natural light never reached that place. Kiad was cowering on the floor, his body shaking. What had been of his brawny [&hellip;]</p>\n"},{"slug":"guildmaster-chapter44","title":"Guild Master &#8211; Chapter 44","excerpt":"<p>The king of guilds and the underwater danger The second floor of our guild&#8217;s dormitory was almost empty, but the rooms were ready to host people, so I proposed Zect and Mizuha to sleep there. “Tomorrow I&#8217;ll officially leave Blue Sagittarius. I&#8217;ll also take the stuff I&#8217;ve left there back. Not like there was anything [&hellip;]</p>\n"},{"slug":"newgame-chapter39","title":"New Game &#8211; Chapter 39","excerpt":"<p>What was of the man who opened the birdcage &#8211; Part 1 Two weeks after Lize had become property of the Queen, Lux called Takumi to see him in his office. It was within the castle. “Hi, slave merchant. This time you&#8217;ve really met my expectations in a positive way.” Lux looked totally different from [&hellip;]</p>\n"},{"slug":"guildmaster-chapter43","title":"Guild Master &#8211; Chapter 43","excerpt":"<p>Feel free to skip this, but please, read the &#8220;tl note&#8221;! We&#8217;ve been on a hiatus for some months because my former editor had a lot of exams at his university and a lot of stuff to do at work, so he couldn&#8217;t dedicate any time to these projects (and he still doesn&#8217;t). I&#8217;m talking [&hellip;]</p>\n"},{"slug":"newgame-chapter38","title":"New Game &#8211; Chapter 38","excerpt":"<p>The birdie&#8217;s tears &#8211; Part 6 The approaching evening darkened the sky, dimming Takumi&#8217;s path as he walked through the aquamarine garden. The glossy marble under his feet kept reflecting a faint light even in the sunset. “Why, are you not a bit late?” Eluria&#8217;s words reached Takumi when he entered the gazebo. Her gaze [&hellip;]</p>\n"},{"slug":"guildmaster-chapter42","title":"Guild Master &#8211; Chapter 42","excerpt":"<p>The phantom fox&#8217;s real body and the new comrade We&#8217;ve got sporadic guests even in that afternoon—that wasn&#8217;t a problem, though, as we pretty much opened our bar pretty much to welcome new requests, our own guild members or the nearby citizens who only wanted to grab some food. I left the bar to take [&hellip;]</p>\n"},{"slug":"newgame-chapter37","title":"New Game &#8211; Chapter 37","excerpt":"<p>The birdie&#8217;s tears &#8211; Part 5 As the match was declared over and the arena emptied, silence fell on the plains and the royal castle&#8230; “Fuck it! Shiiit!” Kiad&#8217;s room was the only exception. He bashed the wall to vent the rage boiling in his stomach. Defeat&#8230; that word was clinging at his mind like [&hellip;]</p>\n"},{"slug":"guildmaster-chapter41","title":"Guild Master &#8211; Chapter 41","excerpt":""},{"slug":"newgame-chapter36","title":"New Game &#8211; Chapter 36","excerpt":"<p>The birdie&#8217;s tears &#8211; Part 4 Takumi and his comrades were now in front of the nobles&#8217; seats, their heads bowed. The most powerful people in the Holy Kingdom of Richtert—the overlords and the queen Eluria Richtert, symbol of her country, were just a few steps away. She was wearing something simpler than usual, trying [&hellip;]</p>\n"},{"slug":"guildmaster-chapter40","title":"Guild Master &#8211; Chapter 40","excerpt":"<p>The Water Cave and the Shadow chaser&#8217;s negotiation Rigel, Lia and McKinley departed to North with Aileen, who had been convinced by Dick. Their destination was the Water Cave. The closer they got to it, the more the temperature dropped, and after an hour of travel by horse, the air started to chill steadily. Still, [&hellip;]</p>\n"},{"slug":"newgame-chapter35","title":"New Game &#8211; Chapter 35","excerpt":"<p>The birdie&#8217;s tears &#8211; Part 3 The next moment, another roar burst in the arena. This time not only the slums&#8217; people were cheering, but also those who were ever-so-slightly interested in Suzuran. The slums&#8217; company fought bravely and achieved the impossible, that&#8217;s why even those who couldn&#8217;t follow the current situation were excited. On [&hellip;]</p>\n"},{"slug":"guildmaster-chapter39","title":"Guild Master &#8211; Chapter 39","excerpt":""},{"slug":"newgame-chapter34","title":"New Game &#8211; Chapter 34","excerpt":"<p>The birdie&#8217;s tears &#8211; Part 2 The arena fell into silence while Boris collapsed on the ground, foam streaming down his lips. A magic knight has been defeated by a demi-human. That unacceptable truth became reality in front of everyone. Still, the end of the first fight was fluted and time—which seemed frozen until then—started [&hellip;]</p>\n"},{"slug":"newgame-chapter33","title":"New Game &#8211; Chapter 33","excerpt":"<p>clicking here! The birdie&#8217;s tears – Part 1 In that week, Richtert was bustling with life. Eluria will hold an official match between Richtert&#8217;s magic knights and the company Suzuran—those words were announced in every layer of the capital, and many people were shocked by it. It was the first time that something like that [&hellip;]</p>\n"},{"slug":"guildmaster-chapter38","title":"Guild Master &#8211; Chapter 38","excerpt":"<p>The graceful explorer and the company&#8217;s truth Sakuya entered the 10th Street, heading to Garamdoor&#8217;s headquarter as her Guild Master had asked. She was an “Explorer”. Her job wasn&#8217;t covert-operations and infiltration oriented, but sometimes top-secret information were out of reach even for those who expertized in the intelligence field. Silver Aquarius&#8217; intelligence department, for [&hellip;]</p>\n"},{"slug":"guildmaster-chapter37","title":"Guild Master &#8211; Chapter 37","excerpt":"<p>https://mangahub.io/chapter/he-didn-t-want-to-be-the-center-of-attention-hence-after-defeating-the-demon-lord-he-became-a-guild-master/chapter-1.1 The ice fox and the ravirim1 race Only one member of the intelligence team, who was currently dressed as a customer, was in the bar—Leeza. She could provide me with some information about the merchants. “I do know something spicy, but treating me to something good will loosen my tongue. Deal, buddy?” “Wait, are [&hellip;]</p>\n"},{"slug":"guildmaster-chapter36","title":"Guild Master &#8211; Chapter 36","excerpt":"<p>The wanderer Shadow chaser and the fleeing beasts When I returned to my bar and things started to quieten down, the night shift had already started and Cody made her way in, dressed in her usual male attire. Even though the General of the Albein&#8217;s army was a girl, she didn&#8217;t drink like one, and [&hellip;]</p>\n"},{"slug":"guildmaster-chapter35","title":"Guild Master &#8211; Chapter 35","excerpt":"<p>The Princess&#8217; magic trainer and the special researcher I let Verlaine take care of the bar in my absence, prepared what I had to and took the wagon to the Magic Academy. Pollon was sitting again on the other side of the reception desk, and although it was only the third time I saw her, [&hellip;]</p>\n"},{"slug":"guildmaster-chapter34","title":"Guild Master &#8211; Chapter 34","excerpt":"<p>TL note: sorry for disappearing for this long, but this year has been quite hard for me and my editor. We do have some great news, though! To avoid sudden and long hiatus like this one, I created a discord server where you can see if we&#8217;re still alive ( &#8211;&gt; https://discord.gg/nf5k8B5 )! You can [&hellip;]</p>\n"},{"slug":"newgame-chapter32","title":"New Game &#8211; Chapter 32","excerpt":"<p>The way to open up the cage – Part 5 The streets of the slums were commonly noisier compared to the upper layers of the city. As midnight approached, the angry roars and cackling of people within a certain bar reached the outside of the building, the same one Takumi was going to enter with [&hellip;]</p>\n"},{"slug":"guildmaster-chapter33","title":"Guild Master &#8211; Chapter 33","excerpt":"<p>The peace&#8217;s restoration and the butler&#8217;s invitation Kirsch Auguste informed the royal capital about the plan of Vinceburg, that consisted in using two other noble families as a scapegoat to protect themselves. The first to hear her was the prime minister, who tried to request an audience with the royal family before the country could [&hellip;]</p>\n"},{"slug":"newgame-chapter31","title":"New Game &#8211; Chapter 31","excerpt":"<p>The way to open up the cage – Part 4 The carriage swayed as it clattered down the road. No one among its passengers muttered a word, and neither did the coachman, who looked busy doing his job. The maid that always took care of Lise was silent while checking her dress and body, then, [&hellip;]</p>\n"},{"slug":"guildmaster-chapter32","title":"Guild Master &#8211; Chapter 32","excerpt":"<p>The once again Forgotten fifth Once we landed with the help lead of the fairy bird, we still were somewhat far from our destination, so we decide to split. Mylarka went to stop Jean Vinceburg&#8217;s escape, and I went to his castle. In the middle of the broad courtyard in front of the mansion was [&hellip;]</p>\n"},{"slug":"newgame-chapter30","title":"New Game &#8211; Chapter 30","excerpt":"<p>The way to open up the cage – Part 3 Twilight painted the upper part of Listina in shades of vermilion. Probably somehow noticing that a long time had passed, Lise rubbed her eyes as she lifted her body. “Did I&#8230; fall asleep&#8230;?” “Yeah. It’s evening right now.” Lize jumped at Takumi&#8217;s voice, not expecting [&hellip;]</p>\n"},{"slug":"guildmaster-chapter31","title":"Guild Master &#8211; Chapter 31","excerpt":"<p>The tiger-race&#8217;s hot springs and the duke&#8217;s struggle After the banquet came to a close, I ended up in the same tent as Riko and Mylarka, but since there was a lot of room, I used a curtain to divide the space, so that I could sleep peacefully. “Yeah&#8230; I must sleep. How much did [&hellip;]</p>\n"},{"slug":"newgame-chapter29","title":"New Game &#8211; Chapter 29","excerpt":"<p>The way to open up the cage – Part 2 As Elsa was spanking Kunon while scolding her, Takumi and the others were analyzing the match&#8217;s details. “&#8230;Elsa just started a spanking session instead of a sparring battle with magic.” “Good. We should start the lesson with our Lady Archbishop, then.” “I mean, should we [&hellip;]</p>\n"},{"slug":"guildmaster-chapter30","title":"Guild Master &#8211; Chapter 30","excerpt":"<p>The Holy sword of light and the secret name After Cody Blancneige finished to talk with Aileen, he departed to the southwest boundary in secret. Silver mug had many bases scattered through the Kingdom of Albein and its capital Alvinas, and all of them were connected by Transfer Magic circles, which could be installed only [&hellip;]</p>\n"},{"slug":"newgame-chapter28","title":"New Game &#8211; Chapter 28","excerpt":"<p>The way to open up the cage – Part 1 The next day, Elsa&#8217;s condition finally improved, so she invited Takumi and the others to the Fairstadt&#8217;s mansion, which wasn&#8217;t any bigger than other nobles&#8217; estates, but it looked more refined. Fresh water gushed out from the fountains and the gardeners’ diligence was evident, given [&hellip;]</p>\n"},{"slug":"newgame-chapter27","title":"New Game &#8211; Chapter 27","excerpt":"<p>The birdie that doesn&#8217;t chirp – Part 3 The approaching twilight started to paint the sky red. As promised, Takumi and his comrades were bringing Lise home, and were currently walking in the streets after descending from the gondola. “Thank you for accompanying me home.” The archbishop bowed her head, and Takumi shook his hand. [&hellip;]</p>\n"},{"slug":"guildmaster-chapter29","title":"Guild Master &#8211; Chapter 29","excerpt":"<p>The hero&#8217;s lie and the tiger-race&#8217;s feast I identified the two bodyguards from the guild cards they brought with them. They were part of the ‘Purple Scorpio’, a guild located on the 5th street that was famous for the high number of assassins and bodyguards among its members. There were many dangerous guys in there. Lang and [&hellip;]</p>\n"},{"slug":"newgame-chapter26","title":"New Game &#8211; Chapter 26","excerpt":"<p>The birdie that doesn&#8217;t chirp – Part 2 As the gondola floated down the river, the elegant townscape around them gradually turned into the slums&#8217;. People tend to relax when they return to places they know. On the other hand, those who set foot into a new territory are usually excited and curious, and it&#8217;s [&hellip;]</p>\n"},{"slug":"monstersguild-chapter31","title":"Monsters&#039; Guild &#8211; Chapter 31","excerpt":""},{"slug":"guildmaster-chapter28","title":"Guild Master &#8211; Chapter 28","excerpt":"<p>The dancing fighter and the road toward peace Aileen took a little distance from the wall and readied herself to smash the window down. “Wait, you don&#8217;t have to destroy it! It’ll be fine even without fighting!” “Say what? This way is cooler!” “If you shatter the window and some little fragment remains on the [&hellip;]</p>\n"},{"slug":"monstersguild-chapter30","title":"Monsters&#039; Guild &#8211; Chapter 30","excerpt":"<p>Victory party Torches lit the city as to drive the night away. “Hahaha!” “More meat incoming!” “This&#8217;s good! Gimme more!” People were drinking and wolfing down food, while others were improvising some strange dances, but everyone was enjoying the victory to the fullest. “In the end, we managed to win.” Lety was slowly chewing the [&hellip;]</p>\n"},{"slug":"newgame-chapter25","title":"New Game &#8211; Chapter 25","excerpt":"<p>The birdie that doesn&#8217;t chirp – Part 1 “Aaah&#8230; speaking formally and minding etiquette made my shoulders stiff&#8230;” The next day, Takumi left the castle again and after cracking his shoulders to relieve some stress, he checked his schedule. “The match will be held in seven days in the western part of the Eltern plains&#8230; [&hellip;]</p>\n"},{"slug":"newgame-chapter24","title":"New Game &#8211; Chapter 24","excerpt":""},{"slug":"guildmaster-chapter27","title":"Guild Master &#8211; Chapter 27","excerpt":"<p>The tiger-race&#8217;s gratitude and the demon girl&#8217;s mission The night breeze scattered the ashes that once were the enemy base. On our way to the tiger-race village, I spotted the last two soldiers left in the area. One of them was asleep due to magic and the other one had fainted. Thinking that it was [&hellip;]</p>\n"},{"slug":"monstersguild-chapter29","title":"Monsters&#039; Guild &#8211; Chapter 29","excerpt":"<p>Bael&#8217;s apostle The leader of the monsters, a humongous frog whose height almost reached five meters, towered over the surrounding monsters. On its head, a crown-like thing showed its strength. “What the hell is that?!” The fighting adventurers froze in place, while the frog started to slowly raise its forelegs. “What is it gonna do?!” [&hellip;]</p>\n"},{"slug":"guildmaster-chapter26","title":"Guild Master &#8211; Chapter 26","excerpt":"<p>The prisoners and the masks under the moonlight Mylarka walked to the girl, whose eyes shined brightly like gems. Demi-humans had their own language, but I could somewhat understand it, and the genius teacher could fluently speak it. “The tiger-race should speak the new werebeast language, so&#8230; Do you understand me?” “Y-Yes, I do! But [&hellip;]</p>\n"},{"slug":"monstersguild-chapter28","title":"Monsters&#039; Guild &#8211; Chapter 28","excerpt":"<p>Secret weapons “Bring forth the catapults!” Lety ordered, and the unit she was in charge of pushed some big machines on the walls. They looked like towers with a big, inclined pole as their summit. The extremity closer to the ground was spoon-shaped, while the other one had a big block with various cords fixed [&hellip;]</p>\n"},{"slug":"newgame-chapter23","title":"New Game &#8211; Chapter 23","excerpt":"<p>The ashen-colored birdie – Part 3 The inner part of the castle&#8217;s pavement was made up of white marble, to represent the elegance of the best part of the capital, and blue stone, that reminded the lake Verna. The royal family called it the ‘aquamarine garden’. They used it to relax in the afternoon, since [&hellip;]</p>\n"},{"slug":"guildmaster-chapter25","title":"Guild Master &#8211; Chapter 25","excerpt":"<p>Encounter with the enemy and the catchphrase A hole in the ceiling of the ranch was used by the fire dragons to enter and exit their nest. I heard that they didn&#8217;t like having the entrance on the ground because earth dragons, their natural enemies, might sneak in during their absence, so that was probably [&hellip;]</p>\n"},{"slug":"monstersguild-chapter27","title":"Monsters&#039; Guild &#8211; Chapter 27","excerpt":"<p>TL note: sorry for the irregular releases but summer weakens me more than sickness. Hope I can get back on track soon. The volunteer soldiers and the monsters The flying unit approached the incoming wave while clutching the bags with their claws. “Guuuys! When we get over them, rip your bags!” Harpy, their leader, started [&hellip;]</p>\n"},{"slug":"monstersguild-chapter26","title":"Monsters&#039; Guild &#8211; Chapter 26","excerpt":"<p>Battle start! “They’re coming!” The guards loudly screamed from the observation tower. “How many and how far are they?!” Hearing the warning, the soldiers stationed on the walls started to get ready. “Too many! Eight green and two black hordes! More are coming!” Counting the approaching wave was impossible. Also, there weren&#8217;t many people who [&hellip;]</p>\n"},{"slug":"newgame-chapter22","title":"New Game &#8211; Chapter 22","excerpt":"<p>The ashen-colored birdie – Part 2 If unauthorized, not even the nobles could step into the top level of Listina, where guards were always patrolling. The Holy Kingdom of Richtert&#8217;s castle was snow white, and people prayed in the cathedral of the Goddess Filia, who they worshipped. It was the territory of important entities like [&hellip;]</p>\n"},{"slug":"guildmaster-chapter24","title":"Guild Master &#8211; Chapter 24","excerpt":"<p>p1, c1, c4, c9, c11, c16, c18. Again, I didn&#8217;t add the colored ones because we haven&#8217;t redrawn them. The laboratory and the masks soaring into the sky Once in Mylarka&#8217;s laboratory, we started rearranging the books on the bookshelves. After working for a while, she handed me a notebook. “Manarina wrote the details of [&hellip;]</p>\n"},{"slug":"monstersguild-chapter25","title":"Monsters&#039; Guild &#8211; Chapter 25","excerpt":"<p>Prepare for battle “Great, leave it there!” “Yes!” A minotaur followed the instructions of the master carpenter and laid on the ground a big trunk. “Hahaha! I knew we&#8217;d have finished this quickly if we got help only by those huge guys!” The man was delighted by the efficiency of the monster. “Are my subordinates [&hellip;]</p>\n"},{"slug":"newgame-chapter21","title":"New Game &#8211; Chapter 21","excerpt":"<p>The ashen-colored birdie – Part 1 “Uaaah! I&#8217;m tired!” Kunon broke the silence of Suzuran’s office while flailing her arms in the air. Karin lifted her face and let her silky black hair sway behind her. “If you don&#8217;t start working, this will never end, you know?” “I know! But I&#8217;m not good at this!” [&hellip;]</p>\n"},{"slug":"guildmaster-chapter23","title":"Guild Master &#8211; Chapter 23","excerpt":"<p>The magic academy and the young teacher I wanted Kirsch to remain safe, so I dispatched some of my guild members specialized in this type of job. The one in charge of gathering information was Leeza. Verlaine entered the office on the second floor and placed the contract in the treasury, then started to remove [&hellip;]</p>\n"},{"slug":"monstersguild-chapter24","title":"Monsters&#039; Guild &#8211; Chapter 24","excerpt":"<p>Hunting business meeting “Thanks for coming.” Trow welcomed them as they stepped into his room. When they arrived at the adventurer&#8217;s guild, they were greeted by the girl at the counter they grew accustomed to from selling raw materials, who then guided them to the Guild Master&#8217;s office. “Hello. You have our most sincere gratitude [&hellip;]</p>\n"},{"slug":"newgame-chapter20","title":"New Game &#8211; Chapter 20","excerpt":"<p>The man who enjoyed his regret – Prologue Takumi slowly opened his eyes and found himself in an empty, blank place. “Hi hi~! How lucky to get another chance!” A humanoid shape appeared from the void scene and spoke with an inappropriate voice. “How much did you last? Around seven years?” Her behavior remained, but [&hellip;]</p>\n"},{"slug":"monstersguild-chapter23","title":"Monsters&#039; Guild &#8211; Chapter 23","excerpt":"<p>The forest of Monsters “We want to ask you to eliminate the big monsters that will come out from the forest.” Ino looked quite tense while saying that. “Is this related to the breeding season?” “Yes, exactly.” “But isn&#8217;t it an annual event? How did you handle it before?” Raiz asked while guessing that there [&hellip;]</p>\n"},{"slug":"guildmaster-chapter22","title":"Guild Master &#8211; Chapter 22","excerpt":"<p>The servant&#8217;s sorrow and the unwavering guild When the bar closed, the girl had already finished her Favor apricot blended with virgin coconut juice. Once she calmed down, the mood softened drastically. “It&#8217;s a bit late for introductions, but my name is Kirsch Auguste. I&#8217;m really sorry about my rudeness.” She had an estoc tied [&hellip;]</p>\n"},{"slug":"monstersguild-chapter22","title":"Monsters&#039; Guild &#8211; Chapter 22","excerpt":"<p>Incoming troubles1 “Aaah!” “Gwaaahhh!” The soldier wrapped in a leather armour swung his battle axe down, splitting the monster’s head in two. “Ice sphere!” Considering the environment, the wizard decided to cast a water spell. “Gyah!” The surrounding trees and bushes froze, cutting the monsters&#8217; escape route and freezing the lower part of those who [&hellip;]</p>\n"},{"slug":"guildmaster-chapter21","title":"Guild Master &#8211; Chapter 21","excerpt":"<p>The general of the army&#8217;s gloom and the noble&#8217;s plan Thanks to the promise with Beatrice, I could get my hands on the former mansion of the Stollen family. The estate agent didn&#8217;t expect me to stay, so the only thing he could say was ‘I&#8217;m really glad you like it.’ No more people running [&hellip;]</p>\n"},{"slug":"monstersguild-chapter21","title":"Monsters&#039; Guild &#8211; Chapter 21","excerpt":"<p>Their return The next dawn, Lety and Merck packed their stuff. “I&#8217;ll bring the bandits with me and tell the general about what we discussed yesterday.” Said Merck with a cheerful smile. He would’ve said that Raiz didn&#8217;t want to return to the army, and that it was necessary to protect him from now on. [&hellip;]</p>\n"},{"slug":"newgame-chapter19","title":"New Game &#8211; Chapter 19","excerpt":"<p>Slave merchant and slave merchant – Part 4 Two weeks went by since the meeting with Lux. In that brief time, Listina changed a lot. Because of the illegal gambles scandal, three famous nobles were put on trial, and since they didn&#8217;t have an alibi, they were arrested, and every participant was properly punished along [&hellip;]</p>\n"},{"slug":"guildmaster-chapter20","title":"Guild Master &#8211; Chapter 20","excerpt":""},{"slug":"monstersguild-chapter20","title":"Monsters&#039; Guild &#8211; Chapter 20","excerpt":"<p>Deal “I&#8217;m home!” After eating with Lety, Raiz returned to his guild. “Welcome back!” Merck happily greeted him. “Wait, where&#8217;s Lety?” Since they went out together, the man thought it was strange that she wasn&#8217;t with him. “She said she&#8217;d return to the inn.” “Ohh&#8230; I see.” He didn&#8217;t look surprised. “Is that fine? Weren&#8217;t [&hellip;]</p>\n"},{"slug":"newgame-chapter18","title":"New Game &#8211; Chapter 18","excerpt":"<p>Slave merchant and slave merchant – Part 3 While Takumi seized Geiz, the guards raided the gambling den and arrested each and every participant. The show was evidence of the city’s corruption. Things needed to be investigated further, so the young man visited a certain place. “Hello, Soft-hearted slave merchant. Sorry for making you come [&hellip;]</p>\n"},{"slug":"guildmaster-chapter19","title":"Guild Master &#8211; Chapter 19","excerpt":"<p>The Demon Lord&#8217;s visit and the new contract Before I noticed, the dawn&#8217;s light pierced through the window. I woke up rather early. I laid my gaze on Beatrice, who was sleeping next to me, and saw her eyelashes quiver. She probably sensed me moving. “Mhh&#8230;” She turned her face up. Her body, who had [&hellip;]</p>\n"},{"slug":"monstersguild-chapter19","title":"Monsters&#039; Guild &#8211; Chapter 19","excerpt":""},{"slug":"newgame-chapter17","title":"New Game &#8211; Chapter 17","excerpt":"<p>Slave merchant and slave merchant – Part 2 Takumi said he was chasing after Geiz, but even though he was irritated, his pace was slow. He followed footprints, stomped and snapped leaves and branches, and entered the forest. At the end of those tracks was an open space, where Geiz was panting heavily while bent [&hellip;]</p>\n"},{"slug":"guildmaster-chapter18","title":"Guild Master &#8211; Chapter 18","excerpt":"<p>The wraith queen&#8217;s bare skin and the endless night “&#8230;Let me introduce ourselves again. The three of us are members of the party that defeated the Demon Lord. If you want, we can bring him here in secrecy and free you from your oath.” “I see&#8230; You are Sweet disaster, Voiceless requiem and the Charming [&hellip;]</p>\n"},{"slug":"monstersguild-chapter18","title":"Monsters&#039; Guild &#8211; Chapter 18","excerpt":"<p>Raiz&#8217;s job &#8211; The town “Hello~! I brought Cockatrice&#8217;s eggs~!” Raiz was knocking at the back door of an inn located in the main street of Dekuch. After some clattering sounds, a chubby woman opened it. “I&#8217;ve been waiting for you~! Today there&#8217;s a lot of orders for them. If you were late, I&#8217;d have [&hellip;]</p>\n"},{"slug":"newgame-chapter16","title":"New Game &#8211; Chapter 16","excerpt":"<p>Slave merchant and slave merchant – Part 1 Two weeks weren&#8217;t a very long time. Elsa asked for the collaboration of the upper part&#8217;s guards, and thanks to Karin&#8217;s detailed information, they could plan a perfect assault to arrest the Amberg organization for hosting illegal gambles. Then, one night, Takumi left Listina. He used a [&hellip;]</p>\n"},{"slug":"guildmaster-chapter17","title":"Guild Master &#8211; Chapter 17","excerpt":"<p>The butler&#8217;s conflict and the summon contract After Yuma purified the ghosts, I decided to return to the silent corridor. I looked from the window and confirmed that there wasn&#8217;t trace of spirits in the garden. She could select the targets that were going to be affected by her power, so she decided to purify [&hellip;]</p>\n"},{"slug":"monstersguild-chapter17","title":"Monsters&#039; Guild &#8211; Chapter 17","excerpt":"<p>Raiz&#8217;s job &#8211; Ranch management “Raiz, today you&#8217;ll come back with us!” “Hey, Lety, Merck.” The day after the shadow unit captured Serga&#8217;s special forces, the tamer&#8217;s old comrades showed up again. “You are welcome, Lady Lety, Mister Merck.” Lamia showed them in politely, and the man greeted her back. “Good morning.” “Raiz! You were [&hellip;]</p>\n"},{"slug":"newgame-chapter15","title":"New Game &#8211; Chapter 15","excerpt":"<p>We decided to write a page dedicated to our supporters. Major companies – Part 4 After he left the station, Takumi was escorted back to Valeria with one of the guards&#8217; carriages. Obviously, Elsa was with him. Once they arrived and sat on the living room&#8217;s sofa, she started talking in a peevish tone. “Let&#8217;s [&hellip;]</p>\n"},{"slug":"newgame-chapter14","title":"New Game &#8211; Chapter 14","excerpt":"<p>Major companies – Part 3 When the new festival came to an end, it was already evening. A long time passed since Takumi was dragged into the spartan room by Elsa. Only a desk, two chairs and some lamps were in it. Takumi kept moving, making his chair creak, while Elsa, who was sitting in [&hellip;]</p>\n"},{"slug":"guildmaster-chapter16","title":"Guild Master &#8211; Chapter 16","excerpt":"<p>The former owner and the saint&#8217;s revival The wavy-haired girl looked at me with her heterochromatic eyes. I could see them clearly even in the dusk&#8217;s light: one was golden, the other was blue. Only spirits were supposed to have golden eyes. “This mansion was once yours&#8230;? How many years ago are we talking about?” [&hellip;]</p>\n"},{"slug":"monstersguild-chapter16","title":"Monsters&#039; Guild &#8211; Chapter 16","excerpt":"<p>TL note: Actually, Arachne captured only one person. We already fixed it. My apologies. Those who hide in the forest Raiz had two kinds of subordinates. The first one was composed of monster with sheer strength as their main characteristic. Dragon, Lamia, Treant and Dryad belonged to this group, along with other. Their abilities shone [&hellip;]</p>\n"},{"slug":"newgame-chapter13","title":"New Game – Chapter 13","excerpt":"<p>Major companies &#8211; Part 2 Mirta&#8217;s victory party lasted until the next day. The slums&#8217; residents were so excited it was like they were still celebrating the Harvest Festival, and since this wasn&#8217;t an official festival, everyone was a little more carefree. Lots of fights, some even involving Valeria&#8217;s members, broke out. The merchants kept [&hellip;]</p>\n"},{"slug":"guildmaster-chapter15","title":"Guild Master &#8211; Chapter 15","excerpt":"<p>Massages and the girl of the attic I was the fifth member of the expedition issued to exterminate the Demon Lord. As I watched over my comrades, I had to face quite the number of problems. One of them was that even though I was accompanying probably the most powerful people in the world, their [&hellip;]</p>\n"},{"slug":"monstersguild-chapter15","title":"Monsters&#039; Guild &#8211; Chapter 15","excerpt":"<p>Need a hero It happened a month before. An expensive rug was spread on the floor, and affixed on the walls were metal armours, swords, and shields. On the other side, huge paintings and various decorations coloured the room. Dozens of money bags wouldn’t have been nearly enough to buy all of that. The one who [&hellip;]</p>\n"},{"slug":"newgame-chapter12","title":"New Game &#8211; Chapter 12","excerpt":"<p>Major companies &#8211; Part 1 The large room was filled with a dim light. The walls were impossible to see, but the few visible objects looked quite valuable, included the ground. At its center stood a single man. His face was as pale as a ghost’s, and trickles of sweat were running down his body. [&hellip;]</p>\n"},{"slug":"guildmaster-chapter14","title":"Guild Master &#8211; Chapter 14","excerpt":"<p>The three heroes&#8217; vacation and the masked butler After we closed the bar, I explained the plan to Mylarka and Aileen. Or rather, I asked them to find a way to make Yuma relax in our new mansion. “Is there something strange about that place? Bringing there Yuma is…” “Gotcha. A ghost or something, right?” [&hellip;]</p>\n"},{"slug":"monstersguild-chapter14","title":"Monsters&#039; Guild &#8211; Chapter 14","excerpt":"<p>Two options “Raiz, someone is going after you.” Stated Merck, his former comrade, and the next moment Arachne brought the suspicious guy she had just caught. “He looks like a civilian, but has calluses on his hands. He probably has combat experience.” Added Merck after examining the man. They decided to move the body beyond [&hellip;]</p>\n"},{"slug":"newgame-chapter11","title":"New Game &#8211; Chapter 11","excerpt":"<p>Leader &#8211; Part 2 The next day, the main street square was filled with a huge crowd that counted every member of Valeria, a hundred and twelve in total. On their faces there wasn’t a trace of the happy mood of the festival or the fatigue it should have left on them. The slums witnessed [&hellip;]</p>\n"},{"slug":"guildmaster-chapter13","title":"Guild Master &#8211; Chapter 13","excerpt":"<p>The haunted mansion and the married couple After I left the temple, I headed north. My destination was a high ground where several mansions owned by nobles were built. That place offered a great view of the capital that spread further below. According to Leeza’s words, one of them was haunted. It was surrounded by [&hellip;]</p>\n"},{"slug":"monstersguild-chapter13","title":"Monsters&#039; Guild &#8211; Chapter 13","excerpt":"<p>Call from an old place “I-It’s been a while, Raiz.” The girl’s face flushed all of a sudden. “Yeah.” She was fidgeting awkwardly, so he greeted her with a friendly tone. “Hey mister, do you know those ladies?” “Ladies?!” The carpenters asked Raiz about its relationship with the newcomers. Merck was shocked about being addressed [&hellip;]</p>\n"},{"slug":"newgame-chapter10","title":"New Game &#8211; Chapter 10","excerpt":"<p>Leader &#8211; Part 1 While the sound of people having fun could still be heard from outside, the entire room fell silent. Geiz rested his massive body on the sofa. On the other side were Mirta and Takumi, with Karin, Kunon, and Jill behind them. “So… what is it that you want to talk about?” [&hellip;]</p>\n"},{"slug":"guildmaster-chapter12","title":"Guild Master &#8211; Chapter 12","excerpt":"<p>News and the young priestess Silver mug’s members specialized in gathering information. They listened carefully to every rumor in the city and then reported everything to me. Each of the twelve adventurer guilds had some sort of intelligence department, except for the top guild White Aries. They didn’t place much weight on information gathering. A [&hellip;]</p>\n"},{"slug":"monstersguild-chapter12","title":"Monsters&#039; Guild &#8211; Chapter 12","excerpt":"<p>Let&#8217;s build a house Bam, bam, bam! The sound of hammering echoed in the air. Raiz and his comrades were working at the construction site where the new Monsters’ Delivery’s base would be built. Since their former office was destroyed by the storm, they needed a new one. The carpenter did him a favor regarding [&hellip;]</p>\n"},{"slug":"guildmaster-chapter11","title":"Guild Master &#8211; Chapter 11","excerpt":"<p>TL note: the lap scene is different in the light novel. The Demon Lord&#8217;s lap and the royal sisters My head was lying on something soft. Someone was caressing me like they were combing my hair with a gentle touch. It was so pleasant that I wanted to fall asleep again, but I had to [&hellip;]</p>\n"},{"slug":"monstersguild-chapter11","title":"Monsters&#039; Guild &#8211; Chapter 11","excerpt":"<p>A new home “Goodbye, my dear house. I won’t forget the days we spent together!” Raiz raised a shout of grief after looking at the dried pieces of lumber that once were his house. “Even though it was brief. Hahaha!” “It was so lively and now it’s so empty!” Unicorn was the only one who [&hellip;]</p>\n"},{"slug":"newgame-chapter9","title":"New Game &#8211; Chapter 9","excerpt":"<p>The Soft-hearted slave merchant &#8211; Part 4 Twilight dyed the sky red. Takumi and his comrades got back to Valeria to report the situation. “Thank you… Thank you so much!” Were the first words that Mirta told them as she bowed. “No problem. Everything proceeded smoothly, after all.” “This is bad, though. Now we have [&hellip;]</p>\n"},{"slug":"guildmaster-chapter10","title":"Guild Master &#8211; Chapter 10","excerpt":"<p>The dragon&#8217;s fury and the light insect Duke Solver’s first book, ‘Dragon slaying for dummies.’ The assault’s plan was explained accurately in the second chapter. First, the dragon won’t pay much attention to its surroundings when it&#8217;s drinking. Fire dragons have a sharp sight, but their field of vision isn’t wide, so they can’t see [&hellip;]</p>\n"},{"slug":"newgame-chapter8","title":"New Game &#8211; Chapter 8","excerpt":"<p>The Soft-hearted slave merchant &#8211; Part 3 ‘Workers Street’ was the boundary that divided the middle part of Listina from the lower one. Since the latter had some criminality issues and people didn’t want to step into that dangerous zone, that street was created. It was also the middle part’s last safety zone, or so [&hellip;]</p>\n"},{"slug":"guildmaster-chapter9","title":"Guild Master &#8211; Chapter 9","excerpt":"<p>Rune and the operation&#8217;s start Three days passed since we accepted Timis’s request. Verlaine explained the plan in detail and brought a map and some chess pieces on the table to simulate it. “This looks like… a board game.” “It’s more like a reproduction of the battle. I carved in my mind how the fire [&hellip;]</p>\n"},{"slug":"monstersguild-chapter10","title":"Monsters&#039; Guild &#8211; Chapter 10","excerpt":"<p>Dragon&#8217;s back Dark clouds covered Dekuch’s sky. Before rainfall, people were getting home in a hurry. “It’s going to rain.” Whispered Raiz, as Unicorn healed the back pain of elders. “You’re right. Tonight might get stormy.” Commented his subordinate, while the people who were getting healed looked up at the sky, worried about the changing [&hellip;]</p>\n"},{"slug":"monstersguild-chapter9","title":"Monsters&#039; Guild &#8211; Chapter 9","excerpt":"<p>Dragon&#8217;s anguish Dragon sighed deeply. He had yet to receive his first job, but as the strongest monster, he couldn’t express his distress over something so trivial. Dragons were prideful beasts, after all. “Hey, Dragon!” Then, someone called him. “Master. How can I help you?” Hiding his anxiety, he firmly faced Raiz. “Lately you don’t [&hellip;]</p>\n"},{"slug":"newgame-chapter7","title":"New Game &#8211; Chapter 7","excerpt":"<p>The Soft-hearted slave merchant &#8211; Part 2 We can’t say that the slums’ public order was handled greatly. There were some rude workers with stubborn dispositions that helped maintaining peace in their streets, but the slums were poor and filled with outcasts and people of that kind. Fights were an everyday occurrence and so was [&hellip;]</p>\n"},{"slug":"guildmaster-chapter8","title":"Guild Master &#8211; Chapter 8","excerpt":"<p>The fire dragon&#8217;s ecology and the subjugation plan The relationship between Timis, Lia and McKinley wasn’t anything special. Lia was hired as Timis’s guard three years before, and McKinley was chosen for this expedition from Lia’s former mercenary guild. A mercenary guild was different from an adventurer guild, starting from their role in case war [&hellip;]</p>\n"},{"slug":"monstersguild-chapter8","title":"Monsters&#039; Guild &#8211; Chapter 8","excerpt":"<p>Dragon, the strongest monster The day started early for Raiz, the manager of the Monsters’ Delivery, and a few of his subordinates. Some fought to get the privilege of waking up their master, some couldn’t stand the cold and waited until their body was warm enough, and some laid an egg. Between those monsters, one [&hellip;]</p>\n"},{"slug":"newgame-chapter6","title":"New Game &#8211; Chapter 6","excerpt":"<p>The Soft-hearted slave merchant &#8211; Part 1 Seven years went by. It might seem a very long time, but things didn’t really change. At least, Listina’s conditions remained the same. Thanks to the massive amount of clean water the Verne Lake’s provided, there weren’t any periods of drought, and shipping channels became the main means [&hellip;]</p>\n"},{"slug":"guildmaster-chapter7","title":"Guild Master &#8211; Chapter 7","excerpt":"<p>The young knight and her knights After the last round of drinks, I made the waitresses tell the customers that we were closing for today. Verlaine came back in the kitchen and gave me Cody’s mug… but behind her, the three girls were still sitting at the counter with their glasses. “Hey, Dick, don’tcha care [&hellip;]</p>\n"},{"slug":"monstersguild-chapter7","title":"Monsters&#039; Guild &#8211; Chapter 7","excerpt":"<p>Treant&#8217;s sap “We need some arboreal monster’s sap or nectar to fix this issue.” “The sap or nectar?” “Arboreal monsters are more resilient than normal plants. This resistance can be used to fight diseases.” “I’m strooong.” Said proudly Treant. “Can you give me some?” Treant nodded. “We can provide the sick wheat with that resistance. [&hellip;]</p>\n"},{"slug":"guildmaster-chapter5","title":"Guild Master &#8211; Chapter 5","excerpt":"<p>The hero with the Holy sword The Silver Aquarius’s bar was always packed with people at night. Or rather, since it didn’t have many seats, when the capacity was exceeded, we concealed the sign at the front door so that no one was interested in entering. A queue outside the door would draw too much [&hellip;]</p>\n"},{"slug":"monstersguild-chapter6","title":"Monsters&#039; Guild &#8211; Chapter 6","excerpt":"<p>Dryad and the wheat field “Is agriculture the main source of food of the city?” A wheat field extended in front of Raiz and his subordinates. “Why have they planted everything so close to the others? They should leave more space between plants.” Dryad, who didn’t have any notion of farming, tilted her head. “Yeeeah, [&hellip;]</p>\n"},{"slug":"newgame-chapter5","title":"New Game &#8211; Chapter 5","excerpt":"<p>A world of slaves &#8211; Part 5 It looked like the guards didn’t want to get involved with the wagon’s owner, who was the head of an organization of slave merchants called Valeria.1 Some of its members showed up as soon as the guards contacted their organization, but they didn’t look like friendly people. More [&hellip;]</p>\n"},{"slug":"guildmaster-chapter4","title":"Guild Master &#8211; Chapter 4","excerpt":"<p>Elucidation and the truth about the Princess “Mylarka, why are you so agitated?” The Princess showed a puzzled expression as she took off her hood, and Mylarka sighed deeply before answering. “I saw your battle with that prince. Normally, it would have been really hard for you to win… Or rather, it would have been [&hellip;]</p>\n"},{"slug":"monstersguild-chapter5","title":"Monsters&#039; Guild &#8211; Chapter 5","excerpt":"<p>Morning duty “Cock-a-doodle-doo!” Sang a cockatrice at the crack of dawn, waking up the other monsters in the ranch. Some immediately got up and started their daily routine right away, while others sluggishly opened their eyes and remained half-asleep until the sun woke them up. Each monster has its own habits. But even among them, [&hellip;]</p>\n"},{"slug":"guildmaster-chapter6","title":"Guild Master &#8211; Chapter 6","excerpt":"<p>Last order and happy birthday “I can make Timis succeed, just let me get in touch with her. If your subordinates don’t want to die, tell them that the guild on the 12th Street will lend them its power. The rest will be up to her.” “Thank you. Anyone would have refused my request, but you…” [&hellip;]</p>\n"},{"slug":"newgame-chapter4","title":"New Game &#8211; Chapter 4","excerpt":"<p>A world of slaves &#8211; Part 4 Let’s introduce Listina, the capital. Richtert Castle was visible over Listina’s roofs, and the town’s structure is divided into upper, middle and lower part. Both the fortress and the town were surrounded by high walls. A huge lake was located south from the capital, a rocky mountain range [&hellip;]</p>\n"},{"slug":"guildmaster-chapter3","title":"Guild Master &#8211; Chapter 3","excerpt":"<p>The first Princess and Sweet disaster I told the Demon Lord to give the Royal Crest back to the Princess before she left, so that it could become our reward if our plan was to succeed. In exchange, the Princess had to pay us the insignificant fee of ten gold coins. I could pay three [&hellip;]</p>\n"},{"slug":"monstersguild-chapter4","title":"Monsters&#039; Guild &#8211; Chapter 4","excerpt":"<p>Let&#8217;s start “How boring.” It was already a week since the grand opening of their guild. Raiz kept waiting for customers to show up, but no one ever did. “Why?! I promoted this place just fine! I even demonstrated that lamias and unicorns are both harmless!” He brought with him the most beautiful and kind monsters he [&hellip;]</p>\n"},{"slug":"newgame-chapter3","title":"New Game &#8211; Chapter 3","excerpt":"<p>A world of slaves &#8211; Part 3 The evening breeze blew the stench of blood in the wagon. The men’s victory roars could be heard outside. The bandits ripped the cloth that served as a curtain and popped their head in the wagon. “Eheh… long time no see, brats.” The children remembered well the face [&hellip;]</p>\n"},{"slug":"guildmaster-chapter2","title":"Guild Master &#8211; Chapter 2","excerpt":"<p>Cold milk and kumis blended with millennial peach juice1 I glanced at the sleeves of the girl’s overcoat, a garment only a high-class person could afford… Seeing that, it became clear what kind of blood flowed in her veins. She probably never wore cheap clothes. She must have caused quite the commotion just to come [&hellip;]</p>\n"},{"slug":"monstersguild-chapter3","title":"Monsters&#039; Guild &#8211; Chapter 3","excerpt":"<p>Let&#8217;s live in this city! “Actually, I’ve come to ask for an available place that can be managed by me for my monsters.” “A place… you say?” Honestly, Trow sounded skeptical about what Raiz planned to do with his monsters. It was obvious, since he came to the city along with a dragon. “As you [&hellip;]</p>\n"},{"slug":"newgame-chapter2","title":"New Game &#8211; Chapter 2","excerpt":"<p>A world of slaves &#8211; Part 2 Several days later, another couple of slave merchants bought the children. They put shackles on everyone and made them get on a covered wagon. The cell where they stayed until now was small, but they tried to spend time peacefully. Lilia taught them mathematic and how to write [&hellip;]</p>\n"},{"slug":"guildmaster-chapter1","title":"Guild Master &#8211; Chapter 1","excerpt":"<p>The beautiful girl and the drunkard The Kingdom of Albein is located in the north side of the continent of Exrea and it boasts two thousand years of history. Fifty thousands out of ten million inhabitants were citizens of Alvinas, the Kingdom’s capital. The nobles, who live under the King, were several hundred, even more [&hellip;]</p>\n"},{"slug":"monstersguild-chapter2","title":"Monsters&#039; Guild &#8211; Chapter 2","excerpt":"<p>Toward the city “Monsters are attacking!” The lookout’s voice echoed from the walls of Dekuch. Soldiers hurried over, immediately shut the gates and prepared their bows. “Where are they?!” No matter where they looked, not a single monster could be found. “Up there! In the sky!” Then, a huge shadow blackened the sky. A cloud [&hellip;]</p>\n"},{"slug":"newgame-chapter1","title":"New Game &#8211; Chapter 1","excerpt":"<p>A world of slaves &#8211; Part 1 He felt like he was being squeezed. When his eyes opened, he found himself in a small, damp room, surrounded by complete darkness. He thought he had successfully transferred from where he was a moment before and reincarnated successfully. Those present were no older than kids. He counted [&hellip;]</p>\n"},{"slug":"guildmaster-prologue2","title":"Guild Master &#8211; Prologue 2","excerpt":"<p>Their respective rewards After we defeated the Demon Lord and took the talisman with us, the King rewarded us. Cody asked for the title of general of the Albein’s army. Mylarka wanted one of the few phantom birds in the world. Yuma requested to be put in charge of the orphanage for the adoption of [&hellip;]</p>\n"},{"slug":"monstersguild-chapter1","title":"Monsters&#039; Guild &#8211; Chapter 1","excerpt":"<p>Monsters out in the cold “Bloody hell, we have no work.” Raiz, the tamer admired by everyone as the strongest ever seen, was in big trouble. This was due to the end of the long war that raged between the Kingdom of Tend and Serga. “What will happen to us when we lose our job…?” [&hellip;]</p>\n"},{"slug":"guildmaster-prologue1","title":"Guild Master &#8211; Prologue 1","excerpt":"<p>The forgotten fifth Everyone, at least once, dreamed of becoming the hero who would defeat the Demon Lord. But, in reality, it’s as hard as winning the lottery. I wanted to face them before anyone else and come back safe and sound. They were in a dangerous place, but even dying on the way back [&hellip;]</p>\n"},{"slug":"newgame-introduction","title":"New Game &#8211; Introduction","excerpt":"<p>The regreat of a man who had felt none The regret still lingering within this man granted him to reincarnate from his former world to a different one. For being reborn, he could wish for one thing. Proficiency with swords, mastery of magic or any other power. All of them are to cleanse his tainted [&hellip;]</p>\n"}]}}}